app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles`
---
  def index
    @profiles = Profile.all

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` IS NULL LIMIT 1
---
  def show
    @profile = Profile.find_by(user_id: params[:user_id])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
    def set_profile
      @profile = Profile.find(params[:id])